# text_prepare.py
# Προετοιμασία ελληνικού κειμένου για NLP
# Η βασική ιδέα είναι ότι πριν μετατρέψουμε προτάσεις σε αριθμούς προσπαθούμε να αφαιρέσουμε τον  "θόρυβο" (σημεία στίξης emojis,κτλ)
# να φέρουμε τα πάντα σε κοινή μορφή δηλαδή πεζά γράμματα και έπειτα  να "διασπάσουμε"το κείμενο σε μικρότερες λέξεις (tokens).Στη συνέχεια αφαιρούμε λέξεις που δεν θα μας βοηθήσουν αργότερα στη διάκριση συναισθήματος (stopwords)

import re                  
# με τη 're'= κανονικές εκφράσεις (regex) κάνουμε αρκετά γρήγορα αντικατάσταση με μοτίβα

#stopwords->δεν μεταφέρουν συναισθηματική πληροφορία. Η αφαίρεσή τους μας βοηθά στο να μειωθεί ο θόρυβος
#δημιουργώ παρακάτω το "set" με τις "stopwprds"
GREEK_STOPWORDS = {
    "ο","η","το","οι","τα","των","στο","στη","στην","στον","σε","με","για","από","απ",
    "ως","πως","που","τι","ποιο","ποια","ποιος","και","ή","να","θα","αν","μη","μην",
    "δεν","δε","είμαι","είσαι","είναι","ήταν","ήμουν","ήσουν","ήμασταν","ήσασταν",
    "τον","την","του","της","μας","σας","μου","σου","τους","τις","ένα","μια","ένας","έναν",
    "εδώ","εκεί","τώρα","λοιπόν","όμως","αλλά","κι","ώστε","τότε","πάλι"
}
    
